{
  "processes": [
    {
      "id": "1.1",
      "category": "strategic",
      "title": "Planning & Goal-Setting",
      "description": "How you set priorities and goals, and build strategy and planning. From weekly priorities to formal planning cycles. Starts simple (what are our top 3 things?) and evolves into structured frameworks as you grow...",
      "stageFocus": {
        "foundation": "Clear priorities for this week/sprint and this quarter. Have a simple 'why we exist' statement. Review and adjust in weekly team sync.",
        "first-hires": "Set monthly goals/rocks for the team. Document your mission and share it. Review progress bi-weekly, adjust direction as needed.",
        "early-revenue": "Implement quarterly OKRs or similar goal framework. Create annual strategic plan. Monthly reviews with team, quarterly strategy discussions.",
        "growth": "Cascade quarterly goals from company to teams. Establish planning rhythms (weekly standups, monthly reviews, quarterly planning). Track progress in dashboards.",
        "scaled": "Full planning cycle: annual strategy, quarterly OKRs cascaded to all teams, weekly/monthly/quarterly review cadence. Metrics-driven adjustments."
      },
      "stages": {
        "foundation": "critical",
        "first-hires": "critical",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "1.2",
      "category": "strategic",
      "title": "Internal Communication",
      "description": "How information flows in your company, from quick Slack updates to formal all-hands meetings. Starts with staying aligned as a small team, evolves into structured channels and rhythms.",
      "stageFocus": {
        "foundation": "Daily quick syncs (standup or async). Use one main channel (Slack/Discord). Share what you're working on, link it to main prios and share and blockers.",
        "first-hires": "Weekly team meeting for alignment. Simple doc/wiki for key info. Clear communication norms (response times, which channel for what).",
        "early-revenue": "Monthly all-hands. Department updates shared regularly. Start knowledge base for processes and decisions. Meeting rhythms established.",
        "growth": "Structured all-hands (monthly/quarterly). Department communication plans. Active knowledge management system. Clear escalation paths.",
        "scaled": "Full communication strategy: all-hands cadence, department updates, accessible documentation standards, multiple channels for different needs."
      },
      "stages": {
        "foundation": "recommended",
        "first-hires": "critical",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "1.3",
      "category": "strategic",
      "title": "Process Improvement & Optimization",
      "description": "Process documentation standards and ownership, continuous improvement methodology and culture, efficiency metrics tracking and review, tool stack optimization and rationalization",
      "stages": {
        "foundation": "future",
        "first-hires": "future",
        "early-revenue": "recommended",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "1.4",
      "category": "strategic",
      "title": "Roles, Org Chart and Organizational Design",
      "description": "Role clarity (RACI/DRI), Org chart maintenance and clarity of reporting lines, continuously evolving through the teams phases",
      "stageFocus": {
        "foundation": "Get clarity on what each founder owns and where everyone's strengths and blind spots are. No formal org chart needed — just make sure decisions aren't falling through the cracks between you.",
        "first-hires": "Write down who owns what, even informally. Be explicit with new hires about reporting lines and who to go to for what. Revisit as each person settles in.",
        "early-revenue": "Document roles and responsibilities as teams form. Use a simple RACI or DRI approach for key decisions. Update as the org evolves — this will change often.",
        "growth": "Maintain a living org chart. Define spans of control, team structure, and escalation paths. Role clarity becomes critical as middle layers form.",
        "scaled": "Org design is a strategic lever. Regularly review structure against company goals. Formalize RACI/DRI across functions, with clear accountability at every level."
      },
      "stages": {
        "foundation": "critical",
        "first-hires": "critical",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "1.5",
      "category": "strategic",
      "title": "Data & Reporting Infrastructure",
      "description": "Company KPI tracking and definition, dashboards, reporting cadence, data quality",
      "stages": {
        "foundation": "future",
        "first-hires": "future",
        "early-revenue": "recommended",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "2.1",
      "category": "financial",
      "title": "Cash Flow Management",
      "description": "Knowing how much money you have and how long it will last. Starts with a simple spreadsheet, evolves into forecasting and scenario planning.",
      "stageFocus": {
        "foundation": "Track bank balance weekly. Know your burn rate. Keep runway visible in a simple spreadsheet linked to the business plan in your pitch deck.",
        "first-hires": "Monthly cash flow forecast (3-6 months out). Track burn rate and runway. Alert when runway drops below 6 months. Plan for payroll timing.",
        "early-revenue": "Rolling 12-month cash forecast. Track against budget monthly. Scenario planning for hiring/spending decisions. Coordinate with fundraising if needed.",
        "growth": "Automated cash forecasting with actuals vs. forecast variance analysis. Department budget owners track their burn. Quarterly scenario modeling.",
        "scaled": "Integrated cash management: real-time dashboards, automated forecasts, treasury management, working capital optimization."
      },
      "stages": {
        "foundation": "critical",
        "first-hires": "critical",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "recommended"
      }
    },
    {
      "id": "2.2",
      "category": "financial",
      "title": "Financial Planning, Budgeting & Analysis",
      "description": "Annual and quarterly budgeting process and timeline, revenue and expense forecasting cadence and accuracy, variance analysis and explanations, department budgets, scenario planning, board/investor reporting package preparation and coordination",
      "stageFocus": {
        "foundation": "Focus on cash flow (see 2.1). Know your monthly burn and when you run out of money. A single spreadsheet is enough linked to the business plan in your pitch deck.",
        "first-hires": "Build a simple headcount and cost budget. Track actual spend monthly against what you expected. Know your runway to the nearest month. Review with co-founders monthly.",
        "early-revenue": "Create a quarterly forecast covering revenue and key cost lines. Review actuals vs forecast monthly and understand the gaps. Start separating one-off costs from recurring ones.",
        "growth": "Introduce an annual budget with quarterly reforecasting. Assign budget ownership to team leads. Build a basic board reporting pack: actuals, forecast, key metrics, and narrative.",
        "scaled": "Full FP&A cycle: annual plan, quarterly reforecast, monthly variance review. Scenario planning for key business risks. Investor reporting package with consistent metrics and commentary."
      },
      "stages": {
        "foundation": "future",
        "first-hires": "recommended",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "2.3",
      "category": "financial",
      "title": "Accounts Receivable (Outgoing Invoices)",
      "description": "Invoice generation and delivery timing, collections process and follow-up (relations with ops people at customers), payment terms management, revenue recognition procedures",
      "stages": {
        "foundation": "future",
        "first-hires": "future",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "2.4",
      "category": "financial",
      "title": "Accounts Payable & Expense Management",
      "description": "Invoice receipt and validation, approval workflows, payment scheduling and execution, employee expenses, corporate card management",
      "stages": {
        "foundation": "recommended",
        "first-hires": "critical",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "2.5",
      "category": "financial",
      "title": "Financial Administration",
      "description": "Day-to-day bookkeeping accuracy, account reconciliation procedures, month-end close process, audit trail and documentation standards, chart of accounts management",
      "stageFocus": {
        "foundation": "Keep it simple and outsourced. Use a bookkeeper or accountant from day one — don't do this yourself. Agree on an API or automation workflow so it will scale later. Set up a basic chart of accounts and make sure receipts and invoices are captured consistently.",
        "first-hires": "Your external bookkeeper should handle month-end close. Your job is to feed them clean data: receipts in, invoices out, payroll records. Agree on a rhythm and stick to it.",
        "early-revenue": "Move to a monthly close with your accountant. Review a basic P&L monthly. Make sure revenue recognition is handled correctly, especially if you have subscriptions or milestones.",
        "growth": "Bring bookkeeping closer to in-house or use a managed accounting service. Establish a proper month-end close checklist. Start tracking by cost centre or department.",
        "scaled": "Full in-house finance team with defined close calendar. Audit trail and documentation standards enforced. Chart of accounts reviewed annually to match business complexity."
      },
      "stages": {
        "foundation": "critical",
        "first-hires": "critical",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "3.1",
      "category": "people",
      "title": "HR Administration",
      "description": "Payroll processing, benefits administration, time-off tracking and approval, sick leave management, contract lifecycle management, labor law compliance, insurance coordination, employee record keeping",
      "stageFocus": {
        "foundation": "Use a payroll service from the start — don't run payroll manually. Get founder contracts and IP assignment in place. Everything else can wait.",
        "first-hires": "Your payroll tool should handle contracts, time-off and basic records. Make sure you're compliant with local labour law for employment contracts. A simple shared doc for time-off tracking is fine at this stage.",
        "early-revenue": "Standardise employment contracts and onboarding paperwork. Track time off properly — informality breaks down when teams grow. Consider a basic HRIS if you're on 15ish people.",
        "growth": "Implement a proper HRIS. HR admin should not be sitting in spreadsheets or inboxes. Benefits administration and compliance reviews become a regular rhythm.",
        "scaled": "Dedicated HR ops function. Automated workflows for contracts, onboarding, offboarding, and compliance. Regular audits of employee records and benefits. Clear escalation paths for HR issues."
      },
      "stages": {
        "foundation": "critical",
        "first-hires": "critical",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "3.2",
      "category": "people",
      "title": "Recruitment & Hiring",
      "description": "How you find and hire people, from posting on your network to structured interview processes. Quality of early hires makes or breaks a startup.",
      "stageFocus": {
        "foundation": "Agree on job description in founding team, Network-based hiring. 2-3 informal conversations. Check references (actually call them). Make sure values align and they can do the job.",
        "first-hires": "Basic job post (AngelList, LinkedIn). 2-3 interview rounds with different people. Simple scorecard to compare candidates. Always check references.",
        "early-revenue": "Defined interview process with scorecards. Headcount planning (know who you need when). Multiple channels for sourcing. Structured reference checks.",
        "growth": "Full hiring process: role definitions, interview panels, scoring rubrics, hiring manager training. Recruiting pipeline tracked. Diversity sourcing strategies.",
        "scaled": "Professional recruiting: ATS system, talent pipelines, employer branding, data-driven hiring decisions, structured onboarding integration."
      },
      "stages": {
        "foundation": "future",
        "first-hires": "critical",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "3.3",
      "category": "people",
      "title": "Onboarding",
      "description": "Pre-arrival preparation (contracts, equipment, system access), structured first day/week experience, role-specific training, culture introduction, check-in process (e.g., 30-60-90 day)",
      "stageFocus": {
        "foundation": "Not applicable yet — save the energy for when you hire.",
        "first-hires": "Make a simple checklist: laptop ordered, accounts set up, contracts signed before day one. On day one: walk them through what you're building, who does what, and how you work. A bad first week is hard to recover from. Campground rule: every new hire should leave the onboarding docs better than they found them.",
        "early-revenue": "Write down your onboarding checklist so it doesn't live in one person's head. Add a 30-day check-in to catch issues early. Role-specific ramp plans help new hires get to impact faster.",
        "growth": "Onboarding should run without the founder. Create a structured first week with clear milestones, tool access workflows, and culture touchpoints. Assign an onboarding buddy. Track 30-60-90 day progress.",
        "scaled": "Onboarding is a system, not an event. Role-specific tracks, automated access provisioning, structured check-ins, and feedback loops to continuously improve the experience."
      },
      "stages": {
        "foundation": "future",
        "first-hires": "critical",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "3.4",
      "category": "people",
      "title": "Offboarding",
      "description": "Resignation and termination procedures, exit interviews, knowledge transfer protocols, equipment and access revocation, final pay and benefits processing",
      "stages": {
        "foundation": "future",
        "first-hires": "recommended",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "3.5",
      "category": "people",
      "title": "Performance Management",
      "description": "Performance review cycles, goal-setting methodology (OKRs/KPIs), 1-on-1 meeting cadence and quality, career development paths, compensation reviews, promotion criteria and process",
      "stages": {
        "foundation": "future",
        "first-hires": "future",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "3.6",
      "category": "people",
      "title": "Employee Satisfaction & Feedback",
      "description": "Employee engagement survey cadence and methodology, pulse check mechanisms, feedback collection channels (1-on-1s, retrospectives, anonymous)",
      "stageFocus": {
        "foundation": "Not a formal process yet, but stay close to each other. Informal check-ins are fine at this stage.",
        "first-hires": "Add a simple start/stop/change question to your weekly team sync: what should we start doing, stop doing, or change? Three questions, five minutes, done. Builds the habit of giving feedback before things fester.",
        "early-revenue": "Start regular 1-on-1s with everyone. Use them to surface what's working and what isn't before it becomes a problem. A quick monthly pulse question (e.g. how are you feeling about work this week, 1-5?) adds signal without overhead.",
        "growth": "Introduce a lightweight engagement survey once or twice a year. Track trends, not just scores. Make sure feedback actually leads to visible action — otherwise people stop responding.",
        "scaled": "Structured engagement programme: pulse surveys, annual engagement survey, 1-on-1 cadence enforced across managers, anonymous feedback channels, and a clear process for acting on results."
      },
      "stages": {
        "foundation": "recommended",
        "first-hires": "recommended",
        "early-revenue": "recommended",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "3.7",
      "category": "people",
      "title": "Learning & Development",
      "description": "Recommended from 25+ people. Covers: Training budget allocation and approval, skills development programs, leadership development initiatives, external courses/conference attendance process",
      "optional": true,
      "stages": {
        "foundation": "future",
        "first-hires": "future",
        "early-revenue": "future",
        "growth": "recommended",
        "scaled": "critical"
      }
    },
    {
      "id": "4.1",
      "category": "legal-and-other-ops",
      "title": "Legal (above certain size also Compliance)",
      "description": "Employment contract templates and execution, freelancer/contractor agreement management, IP assignment clauses in all contracts, legal request intake and external counsel coordination, standard commercial contract templates (SaaS, services, NDA), privacy/GDPR compliance (privacy policy, data processing agreements, consent mechanisms), shareholder agreements and cap table maintenance, basic insurance coverage (liability, professional indemnity, D&O for funded companies)",
      "stages": {
        "foundation": "critical",
        "first-hires": "critical",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "4.2",
      "category": "legal-and-other-ops",
      "title": "Office & Facilities",
      "description": "Office space management, lease negotiations, office supplies procurement, facilities maintenance, health and safety compliance, remote/hybrid work policies",
      "stages": {
        "foundation": "future",
        "first-hires": "recommended",
        "early-revenue": "recommended",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "4.3",
      "category": "legal-and-other-ops",
      "title": "IT Administration & User Support",
      "description": "Note: Technical infrastructure and architecture decisions remain with CTO. COO domain focuses on user-facing IT operations. Covers: Device procurement policies and standards (which laptop/screen models to purchase), software and SaaS license management and optimization, user provisioning and deprovisioning workflows, IT support ticket management and helpdesk, baseline security protocols for users (password managers, 2FA), equipment lifecycle management (ordering, setup, return)",
      "stages": {
        "foundation": "future",
        "first-hires": "recommended",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "4.4",
      "category": "legal-and-other-ops",
      "title": "Vendor & Procurement",
      "description": "Formal procurement process recommended from 50+ people. Early stage (10-50 people): Approval thresholds (e.g., >€5K needs CEO approval), budget ownership by department, visibility mechanism (e.g., Slack channel), basic contract review checklist (especially for IP transfer, data processing, and payment terms). Mature stage (50+ people): Vendor selection and approval process, contract negotiation and management, purchase order workflows, vendor relationship management, performance reviews, preferred vendor list maintenance",
      "optional": true,
      "stages": {
        "foundation": "future",
        "first-hires": "future",
        "early-revenue": "future",
        "growth": "recommended",
        "scaled": "critical"
      }
    },
    {
      "id": "5.1",
      "category": "revenue",
      "title": "Sales Operations",
      "description": "CRM management, sales process and methodology documentation, pipeline management and forecasting accuracy, territory and quota assignment, sales compensation and commission calculation, deal approval workflows, quoting/proposal generation process",
      "stages": {
        "foundation": "future",
        "first-hires": "future",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "5.2",
      "category": "revenue",
      "title": "Customer Acquisition & Lead Management",
      "description": "Lead capture from all channels (website, referrals, marketing, partnerships), lead qualification criteria and scoring, routing and assignment logic, response time SLAs, nurture workflows for different segments",
      "stages": {
        "foundation": "future",
        "first-hires": "future",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "5.3",
      "category": "revenue",
      "title": "Customer Onboarding & Activation",
      "description": "Post-sale handoff from sales to customer success, customer welcome process and kickoff, initial setup and configuration support, time-to-value tracking and optimization, early adoption monitoring, first-value milestone celebration",
      "stages": {
        "foundation": "future",
        "first-hires": "future",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "5.4",
      "category": "revenue",
      "title": "Customer Health, Engagement, Satisfaction, Support",
      "description": "Support ticket management system and workflows, knowledge base maintenance, bug/issue tracking and resolution, customer feedback collection mechanisms. NPS/CSAT measurement cadence and methodology, product feedback aggregation and routing to product team, customer health scoring methodology and tracking, proactive engagement cadence based on segment/tier, regular business reviews with key accounts",
      "stages": {
        "foundation": "future",
        "first-hires": "future",
        "early-revenue": "critical",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "5.5",
      "category": "revenue",
      "title": "Renewal & Retention",
      "description": "Renewal timeline and notification process, churn risk identification and intervention, win-back campaigns for churned customers, contract negotiation for renewals, pricing and packaging optimization based on retention data, renewal forecasting accuracy",
      "stages": {
        "foundation": "future",
        "first-hires": "future",
        "early-revenue": "recommended",
        "growth": "critical",
        "scaled": "critical"
      }
    },
    {
      "id": "5.6",
      "category": "revenue",
      "title": "Service Delivery",
      "description": "Project intake and scoping process, resource allocation and capacity planning, delivery methodology and quality standards, project status communication to customers, post-delivery review and lessons learned, incident/error management and remediation",
      "optional": true,
      "stages": {
        "foundation": "future",
        "first-hires": "future",
        "early-revenue": "recommended",
        "growth": "recommended",
        "scaled": "critical"
      }
    },
    {
      "id": "5.7",
      "category": "revenue",
      "title": "Customer Data & Analytics",
      "description": "Customer database management and data quality, interaction tracking across all touchpoints (CRM, support, success), customer analytics and reporting dashboards, churn analysis and cohort tracking, revenue metrics (MRR, ARR, expansion, churn), data-driven customer segmentation",
      "stages": {
        "foundation": "future",
        "first-hires": "future",
        "early-revenue": "recommended",
        "growth": "critical",
        "scaled": "critical"
      }
    }
  ],
  "dimensions": {
    "reliability": {
      "label": "Is it working reliably?",
      "options": [
        "0 - Frequent failures: Often doesn't work or gets forgotten",
        "1 - Inconsistent: Works sometimes, depends on who's doing it",
        "2 - Mostly reliable: Works but requires vigilance",
        "3 - Reliable: Consistently good outcomes, rare issues",
        "4 - Optimized: Proactively improved, metrics tracked, exceeds expectations"
      ]
    },
    "ownership": {
      "label": "Who owns it?",
      "options": [
        "0 - No owner: Falls through cracks or CEO does it",
        "1 - Ad hoc owner: Whoever remembers or cares does it",
        "2 - Named owner: Someone is responsible but it's not their main job",
        "3 - Dedicated owner: Someone owns this as part of their role",
        "4 - Team/function: Multiple people with clear RACI, backup coverage"
      ]
    },
    "documentation": {
      "label": "Is it documented?",
      "options": [
        "0 - Nonexistent: No process, people don't know what to do",
        "1 - Tribal knowledge: Process exists in someone's head",
        "2 - Partial and not updated: Something is written down but incomplete or no longer reflects how it actually works",
        "3 - Written and current: Documented well enough for someone new to follow, and roughly reflects reality",
        "4 - Accessible and maintained: Easy to find, people actually use it, updated when the process changes"
      ]
    },
    "automation": {
      "label": "Is it automated?",
      "options": [
        "0 - Manual: Everything improvised, email-based, or purely manual (no automation)",
        "1 - Spreadsheet reliance: Using generic tools (Excel, Google Sheets, basic forms)",
        "2 - Dedicated software: Using purpose-built tools for this specific process",
        "3 - Connected systems: Tools integrated with other systems, workflows partially automated",
        "4 - Self-service automation: Highly automated with minimal manual intervention, exception-based handling"
      ]
    },
    "scalability": {
      "label": "Can it scale?",
      "options": [
        "0 - Will break immediately: Can't handle current load",
        "1 - At capacity: Works now but can't handle growth",
        "2 - Room to grow: Can handle 2x volume without changes",
        "3 - Designed to scale: Can handle 5-10x with minor tweaks",
        "4 - Built for scale: Designed for 10x+ growth, modular/flexible"
      ]
    }
  }
}
